=begin
10 個の整数の半角スペース区切りの入力 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/stdin_primer/stdin_primer__integer_space_step4
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
整数 a_1, a_2, ... , a_9, a_10 が半角スペース区切りで与えられるので、改行区切りにして 10 行で出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
以下の形式で標準入力によって与えられます。
整数 a_1, a_2, ... , a_9, a_10 が 半角スペース区切りで与えられます。


a_1 a_2 ... a_9 a_10

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
a_1, a_2, ... , a_9, a_10 を 10 行で出力してください。
また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


a_1
a_2
...
a_9
a_10
条件
すべてのテストケースにおいて、以下の条件をみたします。

・a_1, a_2, ... , a_9, a_10 は 1 以上 10,000 以下の整数

入力例1
10 9 8 7 6 5 4 3 2 1

出力例1
10
9
8
7
6
5
4
3
2
1
=end