# 整数の組からの選択 (paizaランク D 相当)
# https://paiza.jp/works/mondai/stdin_primer/stdin_primer__pair_data_step3

# 入出力例
INPUT1 = <<~"EOS"
  10
  813 813
  8 13
  81 1
  81 3
  8 813
  8 138
  813 8
  83 18
  8 13
  88 88
EOS
OUTPUT1 = <<~"EOS"
  83 18
EOS

# 解答例1
t = 8
# 1 行目入力
n = gets.to_i
# 続く n 行入力
ary = n.times.map { gets.split.map(&:to_i) }
# 出力
puts(ary[t - 1])

# 解答例2
t = 8
# 1 行目入力
n = gets.to_i
# t 行目入力
1.upto(t - 1) { gets }
a, b = gets.split.map(&:to_i)
# 出力
puts("#{a} #{b}")

=begin
整数の組からの選択 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/stdin_primer/stdin_primer__pair_data_step3
問題文のURLをコピーする
 チャレンジする言語

得意な言語を選択してください
コードを書いて解いてみる
 チケット使用済
問題
 下記の問題をプログラミングしてみよう！
1 行目に整数 N が与えられます。
2 行目以降に、N 組の整数 a_i と b_i が N 行で与えられます。(1 ≦ i ≦ N)
8 組目の a_i と b_i を出力してください。

入力される値
以下の形式で標準入力によって与えられます。
1 行目に 整数 N
2 行目から (N + 1) 行目に N 組の整数 a_i, b_i が N 行で与えられます。


N
a_1 b_1
...
a_N b_N

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
8 組目の a_i と b_i を出力してください。
また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


a_8 b_8
条件
すべてのテストケースにおいて、以下の条件をみたします。

・N は 8 以上 100 以下の整数
・a_i, b_i は 1 以上 10,000 以下の整数 (1 ≦ i ≦ N)

入力例1
10
813 813
8 13
81 1
81 3
8 813
8 138
813 8
83 18
8 13
88 88

出力例1
83 18
=end
