# 1 つの整数の組の入力 (paizaランク D 相当)
# https://paiza.jp/works/mondai/stdin_primer/stdin_primer__pair_data_step1

# 入出力例
INPUT1 = <<~"EOS"
  8 13
EOS
OUTPUT1 = <<~"EOS"
  8 13
EOS

# 解答例
# 入力
a, b = gets.split.map(&:to_i)
# 出力
puts("#{a} #{b}")

=begin
1 つの整数の組の入力 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/stdin_primer/stdin_primer__pair_data_step1
問題文のURLをコピーする
 チャレンジする言語

得意な言語を選択してください
コードを書いて解いてみる
 チケット使用済
問題
 下記の問題をプログラミングしてみよう！
1 行目で 1 組の整数 a, b が与えられます。
a と b をそのまま出力してください。

入力される値
以下の形式で標準入力によって与えられます。
1 行目に 1 組の整数 a, bが与えられます。


a b

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
a と b をそのまま出力してください。
また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


a b
条件
すべてのテストケースにおいて、以下の条件をみたします。

・a, b は 1 以上 10,000 以下の整数

入力例1
8 13

出力例1
8 13
=end
